IDEA Open Model
OpenModel.GetMaxId Method (Type)
Compatible with IDEA StatiCa Beta 20.0
 Get max Id value for specified type
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int GetMaxId(
	Type t
)
Public Function GetMaxId (
	t As Type
) As Integer
Parameters
t
Type: System.Type
Type
Return Value
Type: Int32
Max Id value or zero if don't any exists
See Also
Reference
OpenModel Class
GetMaxId Overload
IdeaRS.OpenModel Namespace